(function () {
  // 页面内容修改，监听并找到需要修改的元素
  function allElementMonitor() {
    let hideBtn = document.createElement("div"); // 创建一个按钮用于隐藏/显示新闻块
    // 定义 SVG 图标
    let invisibleIcon = `<div calss="hideBtn" style="display:inline;margin-left:20px;margin-left:10px">
    <!--?xml version="1.0" standalone="no"?--><svg t="1743238150786" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4536" xmlns:xlink="http://www.w3.org/1999/xlink" width="30" height="30"><path d="M332.8 729.6l34.133333-34.133333c42.666667 12.8 93.866667 21.333333 145.066667 21.333333 162.133333 0 285.866667-68.266667 375.466667-213.333333-46.933333-72.533333-102.4-128-166.4-162.133334l29.866666-29.866666c72.533333 42.666667 132.266667 106.666667 183.466667 192-98.133333 170.666667-243.2 256-426.666667 256-59.733333 4.266667-119.466667-8.533333-174.933333-29.866667z m-115.2-64c-51.2-38.4-93.866667-93.866667-132.266667-157.866667 98.133333-170.666667 243.2-256 426.666667-256 38.4 0 76.8 4.266667 110.933333 12.8l-34.133333 34.133334c-25.6-4.266667-46.933333-4.266667-76.8-4.266667-162.133333 0-285.866667 68.266667-375.466667 213.333333 34.133333 51.2 72.533333 93.866667 115.2 128l-34.133333 29.866667z m230.4-46.933333l29.866667-29.866667c8.533333 4.266667 21.333333 4.266667 29.866666 4.266667 46.933333 0 85.333333-38.4 85.333334-85.333334 0-12.8 0-21.333333-4.266667-29.866666l29.866667-29.866667c12.8 17.066667 17.066667 38.4 17.066666 64 0 72.533333-55.466667 128-128 128-17.066667-4.266667-38.4-12.8-59.733333-21.333333zM384 499.2c4.266667-68.266667 55.466667-119.466667 123.733333-123.733333 0 4.266667-123.733333 123.733333-123.733333 123.733333zM733.866667 213.333333l29.866666 29.866667-512 512-34.133333-29.866667L733.866667 213.333333z" fill="#444444" p-id="4537"></path></svg>
        </div>`;
    let visibleIcon = `<div calss="hideBtn" style="display:inline;margin-left:20px;margin-left:10px">
    <?xml version="1.0" standalone="no"?><!DOCTYPE svg PUBLIC "-//W3C//DTD SVG 1.1//EN" "http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd"><svg t="1743238809935" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8047" xmlns:xlink="http://www.w3.org/1999/xlink" width="30" height="30"><path d="M512 298.666667c-162.133333 0-285.866667 68.266667-375.466667 213.333333 89.6 145.066667 213.333333 213.333333 375.466667 213.333333s285.866667-68.266667 375.466667-213.333333c-89.6-145.066667-213.333333-213.333333-375.466667-213.333333z m0 469.333333c-183.466667 0-328.533333-85.333333-426.666667-256 98.133333-170.666667 243.2-256 426.666667-256s328.533333 85.333333 426.666667 256c-98.133333 170.666667-243.2 256-426.666667 256z m0-170.666667c46.933333 0 85.333333-38.4 85.333333-85.333333s-38.4-85.333333-85.333333-85.333333-85.333333 38.4-85.333333 85.333333 38.4 85.333333 85.333333 85.333333z m0 42.666667c-72.533333 0-128-55.466667-128-128s55.466667-128 128-128 128 55.466667 128 128-55.466667 128-128 128z" fill="#444444" p-id="8048"></path></svg>
    </div>`;

    let momoIcon = `<svg width="170" height="28" xmlns="http://www.w3.org/2000/svg" fill="none"> <g id="Layer_1">  <title>Layer 1</title>  <rect id="svg_17" height="50.78431" width="211.56862" y="-11.39216" x="-7.12745" fill="#fa94a6"/>  <g stroke="null">   <rect stroke="null" x="148.18627" y="5.26696" fill="#FA94A6" height="20.3997" width="20.84115"/>   <path stroke="null" fill="white" d="m149.30893,15.93474c-0.06862,-4.044 4.15719,-8.08799 9.14573,-10.66778c5.33481,2.71924 9.28872,6.83296 9.14527,10.94668c-0.15549,4.45958 -3.96383,7.04214 -8.79807,5.92652c-2.28628,-1.46421 -2.79435,-4.39259 -2.6327,-4.74122c-0.93761,2.02198 0.78453,3.85807 1.73136,4.74122c-1.38494,0.55781 -8.47671,0.56552 -8.5916,-6.20543z"/>   <path stroke="null" fill="white" d="m152.22749,22.14433l-0.00806,-0.00416c-1.73885,0 -4.1913,1.64552 -4.02514,3.20732c-0.13871,0.41836 8.45219,0.41836 10.04581,-2.64951c-3.45045,0.76393 -5.32787,-0.20151 -6.01261,-0.55365z"/>   <path stroke="null" fill="white" d="m169.40196,25.55667c-4.0868,0.48804 -9.15269,-0.69726 -9.63768,-2.57979c2.70198,0.2789 4.37145,-0.41836 4.85639,-0.90644c2.91067,0.41836 4.78128,2.16147 4.78128,3.48623z"/>  </g> <g stroke="null"> <rect stroke="null" x="-4.63771" y="1.9411" fill="#FA94A6" height="25.09812" width="150.58869"/> <path stroke="null" fill="white" d="m126.8573,26.72228l-5.40362,0l0,-21.4806c0,-3.0622 5.40362,-3.06219 5.40362,0l0,21.4806z"/>
 <path stroke="null" fill="white" d="m92.99291,9.42963l0,17.29255l6.12444,0l0,-17.29255l4.86351,0c2.70156,0 2.70156,-5.04366 0,-5.04366l-15.85147,0c-2.70206,0 -2.70206,5.04366 0,5.04366l4.86351,0z"/> <path stroke="null" fill="white" d="m51.20305,26.36187l-5.58383,-0.02269l0,-15.31111c0,-1.80129 4.3229,-3.06237 5.58383,-0.0001c1.26093,-1.80139 4.75559,-3.31436 7.92598,0c1.44063,-2.3417 11.16766,-4.14295 11.16766,4.32325l0,11.01064l-5.40362,0l0,-11.01064c0,-2.52181 -4.1432,-2.49912 -4.1432,0.02269l0,10.98795l-5.22342,0l-0.1802,-10.83049c0,-2.52186 -4.1432,-2.52186 -4.1432,0l0,10.83049z"/> <path stroke="null" fill="white" d="m11.39402,6.99787l2.77947,11.70842l2.88207,-11.70842c0.90067,-3.42249 5.86709,-3.60261 6.76771,0.18005l2.70201,19.4541l-5.58433,0l-1.26073,-12.06873l-2.88207,10.08728c-0.18015,0.54041 -0.72052,1.26093 -2.52186,1.26093c-1.80134,0 -2.3417,-0.72052 -2.52186,-1.26093l-3.06222,-10.08728l-1.26098,12.06873l-5.58383,0l2.70196,-19.4541c0.90062,-3.78266 5.94424,-3.60255 6.84466,-0.18005z"/> <path stroke="null" fill="white" d="m27.786,17.89572c0,-6.7787 2.83057,-8.8264 7.92598,-8.8264c5.09542,0 7.92598,2.04771 7.92598,8.8264c0,6.77865 -2.83057,8.8264 -7.92598,8.8264c-5.09542,0 -7.92598,-2.04776 -7.92598,-8.8264z"/> <path stroke="null" fill="#FA94A6" d="m33.19023,17.89592c0,-3.18184 0.90052,-4.14305 2.52186,-4.14305c1.62134,0 2.52186,0.96121 2.52186,4.14305c0,3.18179 -0.90052,4.143 -2.52186,4.143c-1.62134,0 -2.52186,-0.96121 -2.52186,-4.143z"/> <path stroke="null" fill="white" d="m72.45864,17.89572c0,-6.7787 2.83057,-8.8264 7.92598,-8.8264c5.09542,0 7.92598,2.04771 7.92598,8.8264c0,6.77865 -2.83057,8.8264 -7.92598,8.8264c-5.09542,0 -7.92598,-2.04776 -7.92598,-8.8264z"/> <path stroke="null" fill="#FA94A6" d="m77.86226,17.89592c0,-3.18184 0.90052,-4.14305 2.52186,-4.14305c1.62134,0 2.52186,0.96121 2.52186,4.14305c0,3.18179 -0.90052,4.143 -2.52186,4.143c-1.62134,0 -2.52186,-0.96121 -2.52186,-4.143z"/> <path stroke="null" fill="white" d="m118.93182,26.72228l-4.1432,0l-0.1797,-1.46197c-4.1432,3.24233 -10.44784,2.16155 -10.44784,-4.143c0,-5.04367 4.68331,-6.05874 9.54682,-5.04357c0.36041,-2.52181 -3.2221,-2.41328 -3.96249,-2.09594c-0.90102,0.36026 -1.98175,0.83501 -2.88227,0.83501c-1.80154,0 -2.04148,-1.62129 -1.80154,-2.52196c1.26093,-4.25734 13.87022,-3.89708 13.87022,1.98145l0,12.44997z"/> <path stroke="null" fill="#FA94A6" d="m113.63571,20.27297c-1.62134,-0.42029 -4.52469,-0.78647 -3.71051,1.92528c0.54061,1.80124 5.63653,-1.42597 3.71051,-1.92528z"/>
 <path stroke="null" fill="white" d="m134.42287,26.72228l-5.40362,0l0,-21.4806c0,-3.0622 5.40362,-3.06219 5.40362,0l0,10.13239l5.6521,-5.42169c2.19257,-2.13786 5.72388,1.4836 3.5313,3.62146l-4.13968,3.96179l6.48485,9.18666l-5.76454,0l-4.14269,-5.94434l-1.62134,1.44108l0,4.50325z"/>
  </g> </g>
</svg>`;

    let isInjection = true; // 标记按钮是否已插入
    let isInjectionBtn = true; // 标记按钮是否已插入
    let getHtmlBody = document.body;

    // 创建 MutationObserver 监听 DOM 变化
    let observer = new MutationObserver((mutationsList, observer) => {
      for (let mutation of mutationsList) {
        console.log("HTML 内容发生变化");
        if (
          mutation.type === "attributes" ||
          mutation.type === "subtree" ||
          mutation.type === "childList"
        ) {
          try {
            // 获取好友页面按钮
            let friendsBtn = document.getElementsByClassName(
              "_1TdaAqMFadi0UTqilrkelR"
            )[0];
            // 获取新闻块元素
            let newsBlock = document.getElementsByClassName(
              "_17uEBe5Ri8TMsnfELvs8-N"
            )[0];
            console.log(newsBlock);
            try{
              let isHideBtn = document.getElementsByClassName('hideBtn')[0];
              if(isHidden) isInjection = true;
            }catch(e){
              console.log(e);
            }

            if (friendsBtn && isInjectionBtn) {
              friendsBtn.innerHTML = momoIcon;
              isInjectionBtn = false;
            }
            // 读取 localStorage 并决定是否隐藏新闻块
            let isHidden = JSON.parse(localStorage.getItem("isNewsBlockHide"));
            if (newsBlock) {
              newsBlock.style.display = isHidden ? "none" : "block";
            }

            // 如果新闻块存在且按钮尚未插入，则插入隐藏按钮
            if (newsBlock && isInjection) {
              hideBtn.innerHTML = isHidden ? invisibleIcon : visibleIcon;
              newsBlock.insertAdjacentElement("afterend", hideBtn);
              isInjection = false;
            }

            // 绑定按钮点击事件，切换新闻块的可见状态
            if (!isInjection) {
              hideBtn.onclick = () => {
                let currentState = JSON.parse(
                  localStorage.getItem("isNewsBlockHide")
                );
                localStorage.setItem(
                  "isNewsBlockHide",
                  JSON.stringify(!currentState)
                );
                newsBlock.style.display = !currentState ? "none" : "block";
                hideBtn.innerHTML = !currentState ? invisibleIcon : visibleIcon;
              };
            }
          } catch (e) {
            console.log("获取元素失败: " + e);
          }
        }
      }
    });

    // 配置观察选项（监听子元素变化、属性变化等）
    let config = { childList: true, subtree: true, attributes: true };

    // 开始监听 DOM 变化
    observer.observe(getHtmlBody, config);
  }

  // 调用函数，启动监听
  allElementMonitor();
})();
